# Напишите код, который запрашивает число и сообщает является ли оно простым или составным.
# Используйте правило для проверки:
# “Число является простым, если делится нацело только на единицу и на себя”.
# Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.

def is_prime(n):
    if n < 2:
        return False
    for i in range(2, int(n ** 0.5) + 1):
        if n % i == 0:
            return False
    return True


number = int(input("Введите число: "))
if number > 100_000:
    print("Число больше 100000")
elif number < 0:
    print("Число меньше 0")
else:
    if is_prime(number):
        print("Число простое")
    else:
        print("Число не является простым")
